2020.07.09 수업

## Pansdas

In [43]:
import numpy as np
import pandas as pd
dic = {'city' : ['서울', '부산', '대전', '대구', '광주'],
      'year' : [2017,2017,2018,2018,2018],
      'temp' : [18,19,20,21,20]}
data = pd.DataFrame(dic)
data

  city  year  temp
0   서울  2017    18
1   부산  2017    19
2   대전  2018    20
3   대구  2018    21
4   광주  2018    20

1. column 을 도시, 연도, 날씨 로 바꾸세요.

In [9]:
data.columns = ['도시', '연도', '온도']
data

   도시    연도  온도
0  서울  2017  18
1  부산  2017  19
2  대전  2018  20
3  대구  2018  21
4  광주  2018  20

2. 인덱스를 도시로 설정하세요.

In [10]:
data.set_index('도시')

      연도  온도
도시
서울  2017  18
부산  2017  19
대전  2018  20
대구  2018  21
광주  2018  20

In [50]:
dic = {'city' : ['서울', '부산', '대전', '대구', '광주'],
   'year' : [2017,2017,2018,2018,2018],
   'temp' : [18,19,20,21,20]}
data = pd.DataFrame(dic)
data

  city  year  temp
0   서울  2017    18
1   부산  2017    19
2   대전  2018    20
3   대구  2018    21
4   광주  2018    20

4. 서울, 부산, 대구 행을 출력하세요.

In [54]:
data.columns = ['도시', '연도', '온도']
data.set_index('도시', inplace=True)
data

      연도  온도
도시
서울  2017  18
부산  2017  19
대전  2018  20
대구  2018  21
광주  2018  20

In [56]:
data.loc[['서울', '부산', '대구']]

      연도  온도
도시
서울  2017  18
부산  2017  19
대구  2018  21

5. year, temp column을 출력하세요.

In [61]:
data.loc[:,['연도', '온도']]

      연도  온도
도시
서울  2017  18
부산  2017  19
대전  2018  20
대구  2018  21
광주  2018  20

In [111]:
data = {'city' : ['서울', '부산', '대전', '대구', '광주'],
        'year' : [2017,2017,2018,2018,2018],
        'temp' : [18,19,20,21,20]}
df = pd.DataFrame(data)

6-2. city를 index로 설정하세요.

In [112]:
df.set_index('city', inplace=True)
df

      year  temp
city
서울    2017    18
부산    2017    19
대전    2018    20
대구    2018    21
광주    2018    20

7. 부산부터 대구까지의 행을 출력하세요.

In [88]:
df.loc['부산':'대구']

      year  temp
city
부산    2017    19
대전    2018    20
대구    2018    21

8. 서울과 대전 행을 출력하세요.

In [90]:
df.loc[['서울', '대전']]

      year  temp
city
서울    2017    18
대전    2018    20

9. 데이터 추가 - 열 추가하기
```
column에 car 데이터  [50,40,20,30,10]를 추가하세요.
```

In [113]:
car = [50,40,20,30,10]
df['car'] = car
df

      year  temp  car
city
서울    2017    18   50
부산    2017    19   40
대전    2018    20   20
대구    2018    21   30
광주    2018    20   10

10. 조건을 사용하여 high 데이터 추가하기.

```
차량 수 중 40 이상인 데이터를 high 로 추가하세요.
```

In [95]:
df['high'] = df.car >= 40
df

      year  temp  car   high
city
서울    2017    18   50   True
부산    2017    19   40   True
대전    2018    20   20  False
대구    2018    21   30  False
광주    2018    20   10  False

11. 원본을 변화시키지 않고 car 데이터를 빼고 출력하세요.

In [114]:
df.drop('car', 1)
df

      year  temp  car
city
서울    2017    18   50
부산    2017    19   40
대전    2018    20   20
대구    2018    21   30
광주    2018    20   10

#### 12. 원본을 변화시키고 car 데이터 삭제하고 원본데이터 출력하세요.

In [115]:
df.drop(['car'], 1, inplace=True)
df

      year  temp
city
서울    2017    18
부산    2017    19
대전    2018    20
대구    2018    21
광주    2018    20

## Series

1. [4,7,-5,3] 인 시리즈 데이터 생성하세요.

In [119]:
import pandas as pd
s = pd.Series([4,7,-5,3])
s

0    4
1    7
2   -5
3    3
dtype: int64

2. [4,7,-5,3]이고 인덱스가 ['d','b','a','c']인 시리즈 생성하세요.

In [121]:
s.index = ['d','b','a','c']
s

d    4
b    7
a   -5
c    3
dtype: int64

3. 시리즈 데이터 타입 출력하세요.

In [123]:
type(s)

pandas.core.series.Series

4. 각 도시의 인구데이터를 시리즈로 생성하고 인덱스를 도시로 설정하세요.
```
서울  9904312
부산  3448737
인천  2890451
대구  2466052
```

In [20]:
import pandas as pd
s = pd.Series([9904312, 3448737,2890451,  2466052], index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

5. 시리즈의 name 을 '인구'로 설정하세요.

In [2]:
s.name = '인구'
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

6. 인덱스의 name을 '도시'로 설정하세요.

In [3]:
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

7. 인구데이터를 10만으로 나누어 출력하세요.

In [4]:
s / 100000

도시
서울    99.04312
부산    34.48737
인천    28.90451
대구    24.66052
Name: 인구, dtype: float64

8. 대구의 인구를 인덱싱으로 출력하세요.

In [5]:
s['대구']

2466052

9. 슬라이싱과 조건으로 행출력하세요. (1행부터 3행까지, 250만이상출력)

In [6]:
s[1:4]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [7]:
s >= 2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [8]:
s[s >= 2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

10. 인구가 250만 이상이고 500만 이하인 도시 출력하세요.

In [13]:
s[(s>=2500000) & (s<=5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

11. 아래의 데이터를 사용하여 시리즈 s2생성하세요.
```
data = {"서울" : 9123442, "부산" : 3333437,
       "인천" : 2234451, "대전" : 2423452}
       ```

In [17]:
data = {"서울" : 9123442, "부산" : 3333437,
        "인천" : 2234451, "대전" : 2423452}

12. 두 시리즈 데이터의 차이를 나타낸 시리즈데이터를 출력하고 null이 아닌것을 출력하세요.

In [22]:
import pandas as pd

s2 = pd.Series(data)

c = s - s2
c

대구         NaN
대전         NaN
부산    115300.0
서울    780870.0
인천    656000.0
dtype: float64

In [25]:
c[c.notnull()]

부산    115300.0
서울    780870.0
인천    656000.0
dtype: float64

In [26]:
c[c.isnull()]

대구   NaN
대전   NaN
dtype: float64

## DataFrame

1. 아래의 데이터로 데이터 프레임을 생성하세요.

```
import pandas as pd

data = {"2015": [9123442,3333437,2234451,2423452],
       "2010" : [9904312,3448737,2890451,2466052]}
```

In [27]:
import pandas as pd

data = {"2015": [9123442,3333437,2234451,2423452],
       "2010" : [9904312,3448737,2890451,2466052]}
df = pd.DataFrame(data)
df

      2015     2010
0  9123442  9904312
1  3333437  3448737
2  2234451  2890451
3  2423452  2466052

2. 인덱스로 ['서울', '부산','인천','대구'] 추가하세요.

In [28]:
df.index = ['서울', '부산', '인천', '대구']
df

       2015     2010
서울  9123442  9904312
부산  3333437  3448737
인천  2234451  2890451
대구  2423452  2466052

In [ ]:
#3. 데이터만 들어있을 때 데이터 프레임 구성하기 df2


data = [[9123442,3333437,2234451,2423452],
        [9904312,3448737,2890451,2466052]]
idx = ['2015', '2010']
col = ['서울', '부산', '인천', '대구']

In [29]:
df2 = pd.DataFrame(data)
df2

      2015     2010
0  9123442  9904312
1  3333437  3448737
2  2234451  2890451
3  2423452  2466052

4. 행과 열을 바꾸세요. - df3에 저장

In [31]:
df3 = df2.T
df3

            0        1        2        3
2015  9123442  3333437  2234451  2423452
2010  9904312  3448737  2890451  2466052

5. [9762546, 3512547, 2517680, 2456016]의 데이터를 2005 데이터로 추가하세요.

In [35]:
df2['2005'] = [9762546, 3512547, 2517680, 2456016]
df2

      2015     2010     2005
0  9123442  9904312  9762546
1  3333437  3448737  3512547
2  2234451  2890451  2517680
3  2423452  2466052  2456016

6. 2010데이터 중 250만 보다 큰 행을 출력하세요.

In [39]:
df['2010'][df['2010'] > 2500000]

서울    9904312
부산    3448737
인천    2890451
Name: 2010, dtype: int64

7. 서울과 부산의 2015, 2010데이터를 출력하세요.

In [43]:
df.loc[['서울', '부산'],['2015', '2010']]

       2015     2010
서울  9123442  9904312
부산  3333437  3448737

8. 인덱스를 이용하여 7번을 출력하세요.

## CSV 파일 1

In [67]:
import numpy as np
drive_path = r"c:/Apps/temp/"
p_number = pd.read_csv(drive_path + "population_number.csv",index_col="도시" ,encoding="euc-kr")
p_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

# 1. 열 데이터의 갯수를 출력하세요.

In [68]:
p_number.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

2. 
s에 0 부터 5까지의 랜덤한 정수 100개를 시리즈로 생성하고 각 값이 얼마나 나왔는지 출력하세요.

In [69]:
s = pd.Series(np.random.randint(6, size = 100))

s.value_counts()

2    29
3    19
0    17
4    14
5    11
1    10
dtype: int64

3. 2010 열 데이터를 오름차순으로 정렬하여 나타내세요.

In [73]:
p_number['2010'].sort_values(ascending=True)

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

4. 전체 데이터를 2010데이터를 기준으로 정렬하세요.

In [75]:
p_number.sort_values(by='2010')

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

5. 전체 데이터를 지역과 2010을 기준으로 정렬하세요.

In [77]:
p_number.sort_values(by=['지역','2010'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

## CSV 파일 2

1. score 변수에 csv데이터를 저장하고 출력하시오./
경로 : drive_path + "score.csv" /인덱스를 '과목'으로 설정하세요. /encoding='euc-kr'

In [79]:

score = pd.read_csv(r'C:\Apps\temp\score.csv',index_col='과목', encoding = 'euc-kr')
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

2. 각 반의 총점을 정렬하여 내림차순으로 출력하세요.

In [80]:
score.sum().sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

3. 학생들의 성적을 과목에 대해 내림차순 정렬하세요.

In [96]:
score.sort_values(by='과목', ascending=False)

    1반  2반  3반  4반   합계
과목
영어  76  92  45  69  282
수학  45  44  73  39  201
사회  92  81  85  40  298
국어  47  92  45  69  253
과학  11  79  47  26  163

4. 전체 데이터에 합계 열을 추가하세요.

In [90]:
score = pd.read_csv(r'C:\Apps\temp\score.csv',index_col='과목', encoding = 'euc-kr')

score['합계'] = score.sum(1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

5. 각 반의 최고점을 출력하세요.

In [81]:
score.max()

1반    92
2반    92
3반    85
4반    69
dtype: int64

6. 각 반의 최저점을 출력하세요.

In [82]:
score.min()

1반    11
2반    44
3반    45
4반    26
dtype: int64

7. 각 반의 최고 최저점을 데이터 프레임으로 나타내세요. column 이름 = max, min

In [84]:
s = pd.DataFrame()
s['max'] = score.max()
s['min'] = score.min()
s

    max  min
1반   92   11
2반   92   44
3반   85   45
4반   69   26

In [105]:
data_dic = {"A":[1,3,3,4,4], "B":[1,2,2,3,3], "C":[1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

9.'평균' 행을 추가하세요.

In [100]:
df3['평균'] = df3.mean(1)
df3

   A  B  C        평균
0  1  1  1  1.000000
1  3  2  2  2.333333
2  3  2  4  3.000000
3  4  3  4  3.666667
4  4  3  5  4.000000

10. 각 과목별 최고 최저점의 차이를 출력하세요.

In [104]:
a = score.max()
b = score.min()
c = a-b
c[0:4]

1반    81
2반    48
3반    40
4반    43
dtype: int64

11. 차이가 가장 큰 과목 명을 출력하세요.

12. min_max(x) 함수를 만들고, apply를 사용하여 score에서 각 반의 최고 최저점의 차이를 출력하세요.

In [114]:
def max_min(x):
    return x.max() - x.min()

score.apply(max_min, )
score.loc[:'과학', :'4반'].apply(max_min, axis=1)

과목
수학    34
영어    47
국어    47
사회    52
과학    68
dtype: int64

In [117]:
data_dic = {"A":[1,3,3,4,4], "B":[1,2,2,3,3], "C":[1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

13. df3의 데이터 중 각 수가 얼마나 사용되었는지 df4에 나타내세요. - apply

In [118]:
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

14. df4에서 NaN값 0으로 채우세요.

In [120]:
df4.fillna(value=0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

15. score의 정보 가져오세요.

In [117]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

15-2. describe써보기

In [116]:
df3.describe()

              A        B         C
count  5.000000  5.00000  5.000000
mean   3.000000  2.20000  3.200000
std    1.224745  0.83666  1.643168
min    1.000000  1.00000  1.000000
25%    3.000000  2.00000  2.000000
50%    3.000000  2.00000  4.000000
75%    4.000000  3.00000  4.000000
max    4.000000  3.00000  5.000000

16. score 데이터에서 앞에서부터 3개만 가져오세요.

In [121]:
score.head(3)

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253

17. score 데이터에서 뒤에서부터 3개만 가져오세요.

In [122]:
score.tail(3)

    1반  2반  3반  4반   합계
과목
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

## 카테고리

In [123]:



ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

# 1. 카테고리로 나타내기 cats변수에 저장하세요.

In [125]:
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 노년, 청년, 장년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

2. cats 의 카테고리 목록 출력

In [127]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

3. age_arr에 1번의 'ages' column을 하나를 만들어라.

In [130]:
age_arr = pd.DataFrame(ages, columns=['ages'])
age_arr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

3-2. 두번째 행에 카테고리로 열 'age_cat'을 생성하세요.

In [131]:
age_arr['age_cat'] = pd.cut(ages, bins, labels=labels)
age_arr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

4. 각 카테고리 별 데이터 수를 출력하세요.

In [132]:
age_arr['age_cat'].value_counts()

청년      3
장년      2
중년      2
미성년자    2
노년      1
Name: age_cat, dtype: int64

5. train = pd.read_csv(drive_path + "train.csv", index_col="PassengerId") 실행하세요.

In [137]:
train = pd.read_csv(r'C:\Apps\temp\train.csv', index_col="PassengerId") 
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

6. train의 각 column별 데이터 수를 출력하세요.

In [140]:
train.count()

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

7. 승객중 성별(Sex) 인원수, 나이별(Age) 인원수, 선실별(Pclass), 생존(Survived)인원수 구하세요.

In [147]:
train['Sex'].value_counts()
# train['Age'].value_counts()
# train['Pclass'].value_counts()
# train['Survived'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

8. 생존한(1) 인원 중 나이별로 사람수 분류하세요.

In [150]:
#자료
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
survivor = train[train['Survived'] == 1]
survivor

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [151]:
survivor_c = pd.cut(survivor['Age'], bins, labels=labels)
survivor_c.value_counts()

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: Age, dtype: int64

9. 사망한(0) 인원 중 나이별로 사람수 분류하세요.(카테고리화)

10. 생존한 인원 중 남성, 여성 출력하세요.

11. 
```
# groupby
df5 = pd.DataFrame({
    'key1' : ['A','A','B','B','A'],
    'key2' : ['one','two', 'one','two','one'],
    'data1' : [1, 2, 3, 4, 5],
    'data2' : [10, 20, 30, 40, 50]
})
```

#### groupby 연습

In [ ]:

df5 = pd.DataFrame({
'key1' : ['A','A','B','B','A'],
'key2' : ['one','two', 'one','two','one'],
'data1' : [1, 2, 3, 4, 5],
'data2' : [10, 20, 30, 40, 50]
})
df5

12. key1과 data2 열 데이터를 key1을 기준으로 그룹화 하세요.

13. 각 그룹 별 합계를 출력하세요.

14. train 데이터에서 선실과 성별을 기준으로 생존자 수를 구하세요.

## merge 는 라이브러리 실습 예제 207!